hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/HPM6800/HPM68D2/HPM68D2_svd.xml
        <register>
          <name>CAM_SYNC_HCNT_BEST</name>
          <description>best HCNT value for CAMSYNC mode</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>HYST</name>
              <description>hysteresys of acceptable HCNT Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VAL</name>
              <description>best acceptable HCNT Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAM_SYNC_HCNT_MAX</name>
          <description>max HCNT value for CAMSYNC mode</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>maximal acceptable HCNT Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAM_SYNC_HCNT_ST</name>
          <description>current HCNT value for CAMSYNC mode</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>current HCNT value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHADOW_DONE_ST</name>
          <description>Shadow done status</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>current shadow_done value for plane 7,...,0 respectively</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHADOW_DONE_INT_EN</name>
          <description>Shadow done interrupt enable</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>shadow_done interrupt enable for plane 7,...,0 respectively</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x40</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
          <name>LAYER[%s]</name>
          <description>no description available</description>
          <addressOffset>0x200</addressOffset>
          <register>
            <name>LAYCTRL</name>
            <description>Layer Control Register</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFD</resetMask>
            <fields>
              <field>
                <name>RESAMPLE_VRATIO</name>
                <description>Resample the input data stream in the verticle direction
0: don't resample
positive n: upsample-by-n+1 (2 to 8)
negtive n: downsample-by-n+1 (2 to 8)</description>
                <bitOffset>28</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RESAMPLE_HRATIO</name>
                <description>Resample the input data stream in the horizontal direction
0: don't resample
positive n: upsample-by-n+1 (2 to 8)
negtive n: downsample-by-n+1 (2 to 8)</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NORMLZ_OUT</name>
                <description>Normalize the pixel out for the not-overlapped pixels</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HANDSHAKE_ABORT_INT_EN</name>
                <description>1: Enable the handshake abort error interrupt.
0: don't Enable the handshake abort error interrupt.
Abort is generated when the LCDC is going to switch bank to a new bank, and the new bank data is not ready yet.
Abort is only useful when communicating with the offline calculator (such as PDMA as the active pixel generator mode).
PDMA as the active generator mode, means it is the first pixel generator with data sources from offline memory, and not from on-the-fly streaming data (such as camera captured data).
While with on-the-fly streaming data, error condition is indicated by display buffer underflow.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HANDSHAKE_BUFSIZE</name>
                <description>1: handshake buffer is 16 rows hight per ping or pang buf.
0: handshake buffer is 8 rows hight per ping or pang buf.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE_HANDSHAKE</name>
                <description>Enable handshake with input pixel controller. When this is set, the LCDC will not process an entire framebuffer,
but will instead process rows of NxN blocks in a double-buffer handshake with the input pixel controlller. This enables
the use of the onboard SRAM for a partial frame buffer. Only valid for Plane 0 &amp; 1.
1: handshake enabled
0: handshake disabled</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PACK_DIR</name>
                <description>The byte sequence of the 4 bytes in a 32-bit word.
1: {A0, A1, A2, A3} byte re-ordered.
0: {A3, A2, A1, A0} the normal case with no byte re-order</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SHADOW_LOAD_EN</name>
                <description>Shadow Load Enable
The SHADOW_LOAD_EN bit is written to 1 by software after all DMA control registers are written. If set to 1, shadowed control registers are updated to the active control registers on internal logical VSYNC of next frame. If set to 0, shadowed control registers are not loaded into the active control registers. The previous active control register settings will be used to process the next frame. Hardware will automatically clear this bit, when the shadow registers are loaded to the active control regsisters.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>YUV_FORMAT</name>
                <description>The YUV422 input format selection.
00b - The YVYU422 8bit sequence is U1,Y1,V1,Y2
01b - The YVYU422 8bit sequence is V1,Y1,U1,Y2
10b - The YVYU422 8bit sequence is Y1,U1,Y2,V1
11b - The YVYU422 8bit sequence is Y1,V1,Y2,U1
If not YUV422 mode,
FORMAT[0]: asserted to exchange sequence inside the bytes. Org [15:8]--&gt;New[8:15], Org [7:0]--&gt;New[0:7]. (First exchange)
FORMAT[1]: asserted to exchange the sequence of the odd and even 8 bits. Org Even [7:0]--&gt;New[15:8], Org Odd [15:8]--&gt;New[7:0]. (Second exchange)</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PIXFORMAT</name>
                <description>Layer encoding format (bit per pixel)
0000b - 1 bpp (pixel width must be multiples of 32), pixel sequence is from LSB to MSB in 32b word.
0001b - 2 bpp (pixel width must be multiples of 16), pixel sequence is from LSB to MSB in 32b word.
0010b - 4 bpp (pixel width must be multiples of 8), pixel sequence is from LSB to MSB in 32b word.
0011b - 8 bpp  (pixel width must be multiples of 4), pixel sequence is from LSB to MSB in 32b word.
0100b - 16 bpp (RGB565), the low byte contains the full R component.
0111b - YCbCr422 (Only layer 0/1 can support this format), byte sequence determined by LAYCTRL[YUV_FORMAT]
1001b - 32 bpp (ARGB8888), byte sequence as B,G,R,A
1011b - Y8  (pixel width must be multiples of 4), byte sequence as Y1,Y2,Y3,Y4</description>
                <bitOffset>10</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LOCALPHA_OP</name>
                <description>The usage of the LOCALPHA[7:0]: (The system alpha value is not the data valid mask, the non-zero alpha value per pixel indicates a valid pixel. If no such per pixel alpha value, it means all the pixels are valid)
0: the LOCALPHA[7:0] is invalid, use the alpha value from the data stream
1: the LOCALPHA[7:0] is used to override the alpha value in the data stream (useful when the data stream has no alpha info)
2: the LOCALPHA[7:0] is used to scale the alpha value from the data stream
Others: Reserved</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INALPHA_OP</name>
                <description>The usage of the INALPHA[7:0]: (The system alpha value is not the data valid mask, the non-zero alpha value per pixel indicates a valid pixel. If no such per pixel alpha value, it means all the pixels are valid)
0: the INALPHA[7:0] is invalid, use the alpha value from previous pipeline
1: the INALPHA[7:0] is used to override the alpha value from previous pipeline.  (useful when the corresponding data stream has no alpha info)
2: the INALPHA[7:0] is used to scale the alpha value from previous pipeline
Others: Reserved</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AB_MODE</name>
                <description>Alpha Blending Mode
0: SKBlendMode_Clear;
3: SKBlendMode_SrcOver
14: SRC org
15: DST org
Others: Reserved.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EN</name>
                <description>Asserted when the layer is enabled. If this layer is not enabled, it means a bypassing plane.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ALPHAS</name>
            <description>Layer Alpha Register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LOCD</name>
                <description>The system alpha value for the data stream of current layer stream (SRC)</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IND</name>
                <description>The system alpha value for the input stream from previous stage (DST)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYSIZE</name>
            <description>Layer Size Register</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HEIGHT</name>
                <description>Height of the layer in pixels</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WIDTH</name>
                <description>Width of the layer in pixels (Note: not actual width-1)
The layer width must be in multiples of the number of pixels that can be stored in 32 bits, and therefore differs depending on color encoding. For example, if 2 bits per pixel format is used, then the layer width must be configured in multiples of 16.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYPOS</name>
            <description>Layer Position Register</description>
            <addressOffset>0xc</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Y</name>
                <description>The vertical position of top row of the layer, where 0 is the top row of the panel, positive values are below the top row of the panel.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>X</name>
                <description>The horizontal position of left-hand column of the layer, where 0 is the left-hand column of the panel, positive values are to the right the left-hand column of the panel.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>START0</name>
            <description>Layer Buffer Pointer Register</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ADDR0</name>
                <description>Input buffer Start address 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LINECFG</name>
            <description>Layer Bus Config Register</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xE0FFFFFF</resetMask>
            <fields>
              <field>
                <name>MPT_SIZE</name>
                <description>Maximal Per Transfer Data Size:
0: 64 bytes
1: 128 bytes
2: 256 bytes
3: 512 bytes
4: 1024 bytes</description>
                <bitOffset>29</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MAX_OT</name>
                <description>the number of outstanding axi read transactions.
If zero, it means max 8.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PITCH</name>
                <description>Number of bytes between 2 vertically adjacent pixels in system memory. Byte granularity is supported, but SW should align to 64B boundary.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BG_CL</name>
            <description>Layer Background Color Register</description>
            <addressOffset>0x1c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ARGB</name>
                <description>ARGB8888. It is only useful in the last active stage in the pipeline.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CSC_COEF0</name>
            <description>Layer Color Space Conversion Config Register 0</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>YCBCR_MODE</name>
                <description>This bit changes the behavior when performing U/V converting.
0b - Converting YUV to RGB data
1b - Converting YCbCr to RGB data</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Enable the CSC unit in the LCDC plane data path.
0b - The CSC is bypassed and the input pixels are RGB data already
1b - The CSC is enabled and the pixels will be converted to RGB data
This bit will be shadowed.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>C0</name>
                <description>Two's compliment Y multiplier coefficient C0. YUV=0x100 (1.000) YCbCr=0x12A (1.164)</description>
                <bitOffset>18</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>UV_OFFSET</name>
                <description>Two's compliment phase offset implicit for CbCr data UV_OFFSET. Generally used for YCbCr to RGB conversion.
YCbCr=0x180, YUV=0x000 (typically -128 or 0x180 to indicate normalized -0.5 to 0.5 range).</description>
                <bitOffset>9</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>Y_OFFSET</name>
                <description>Two's compliment amplitude offset implicit in the Y data Y_OFFSET. For YUV, this is typically 0 and for YCbCr, this is
typically -16 (0x1F0).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CSC_COEF1</name>
            <description>Layer Color Space Conversion Config Register 1</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>C1</name>
                <description>Two's compliment Red V/Cr multiplier coefficient C1. YUV=0x123 (1.140) YCbCr=0x198 (1.596).</description>
                <bitOffset>16</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>C4</name>
                <description>Two's compliment Blue U/Cb multiplier coefficient C4. YUV=0x208 (2.032) YCbCr=0x204 (2.017).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CSC_COEF2</name>
            <description>Layer Color Space Conversion Config Register 2</description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>C2</name>
                <description>Two's compliment Green V/Cr multiplier coefficient C2. YUV=0x76B (-0.581) YCbCr=0x730 (-0.813).</description>
                <bitOffset>16</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>C3</name>
                <description>Two's compliment Green U/Cb multiplier coefficient C3. YUV=0x79C (-0.394) YCbCr=0x79C (-0.392).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
