hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/HPM6800/HPM68D2/HPM68D2_svd.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="GWC0">
      <name>GWC1</name>
      <description>GWC1</description>
      <groupName>GWC</groupName>
      <baseAddress>0xf101c000</baseAddress>
    </peripheral>
    <peripheral>
      <name>MIPI_DSI0</name>
      <description>MIPI_DSI0</description>
      <groupName>MIPI_DSI</groupName>
      <baseAddress>0xf1020000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x194</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>version</name>
          <description>version</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x3134302A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VERSION</name>
              <description>version of DSI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pwr_up</name>
          <description>power up</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>SHUTDOWNZ</name>
              <description>0x0: reset the core
0x1: power up the core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>clkmgr_cfg</name>
          <description>divide lanebyteclk for timeout</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>TO_CLK_DIVISION</name>
              <description>the timeout clock division factor for HS to LP and LP to HS transition error</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_ESC_CLK_DIVISION</name>
              <description>the division factor for the TX Escape clock source lanebyteclk</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dpi_vcid</name>
          <description>virtual channel ID for DPI traffic</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>DPI_VCID</name>
              <description>the DPI virtual channel id to the video mode packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dpi_color_coding</name>
          <description>dpi color coding</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000010F</resetMask>
          <fields>
            <field>
              <name>LOOSELY18_EN</name>
              <description>when set to 1, this bit activates loosely packed variant to 18-bit configurations</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPI_COLOR_CODING</name>
              <description>configures the DPI color for video mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dpi_cfg_pol</name>
          <description>the polarity of DPI signals</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>COLORM_ACTIVE_LOW</name>
              <description>configures the color mode pin as active low</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHUTD_ACTIVE_LOW</name>
              <description>configures the shutdown pin as active low</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSYNC_ACTIVE_LOW</name>
              <description>configures the horizontal synchronism pin as active low</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSYNC_ACTIVE_LOW</name>
              <description>configures the vertical synchronism pin as active low</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAEN_ACTIVE_LOW</name>
              <description>configures the data enable pin active low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dpi_lp_cmd_tim</name>
          <description>the timing for low-power commands sent while in video mode</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <fields>
            <field>
              <name>OUTVACT_LPCMD_TIME</name>
              <description>transmission of commands in low-power mode, defines the size in bytes of the largest pachet that can fit in a line during the VSA VBP and VFP;</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVACT_LPCMD_TIME</name>
              <description>transmission of commands in low-power mode, defines the size in bytes of the largest packet that can fit in a line during the VACT region.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pckhdl_cfg</name>
          <description>configures how EoTp, BTA, CRC and ECC to be used</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>EOTP_TX_LP_EN</name>
              <description>enable the EoTp transmission in low-power</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_RX_EN</name>
              <description>enable the crc reception and error reporting</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_RX_EN</name>
              <description>enable the ecc reception error correction and reporting</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BTA_EN</name>
              <description>enable the bus turn-around request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EOTP_RX_EN</name>
              <description>enable the EoTp reception</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EOTP_TX_EN</name>
              <description>enable the EoTp transmission in high-speed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gen_vcid</name>
          <description>configures the virtual channel ID of read response to store and return to generic interface</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00030303</resetMask>
          <fields>
            <field>
              <name>GEN_VCID_TX_AUTO</name>
              <description>indicates the generic interface virtual channel identification where generic packet is automatically generated and transmitted</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEN_VCID_TEAR_AUTO</name>
              <description>indicates the virtual channel identification for tear effect by hardware</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEN_VCID_RX</name>
              <description>indicates the generic interface read-back virtual channel identication</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>mode_cfg</name>
          <description>configures the mode of operation between video or command mode</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>CMD_VIDEO_MODE</name>
              <description>0x0: video mode
0x1: command mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_mode_cfg</name>
          <description>several aspect of video mode operation</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0111FF03</resetMask>
          <fields>
            <field>
              <name>VPG_ORIENTATION</name>
              <description>indicates the color bar orientation :
0x0: vertical mode
0x1: horizontal mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VPG_MODE</name>
              <description>0x0: colorbar
0x1: berpattern, vertical only</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VPG_EN</name>
              <description>enable video mode pattern generator</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_CMD_EN</name>
              <description>enable command transmission only in low-power mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_BTA_ACK_EN</name>
              <description>enable the request for an acknowledge response at the end of a frame</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_HFP_EN</name>
              <description>enable the return to low-power inside the HFP period when timing allows</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_HBP_EN</name>
              <description>enable the return to low-power inside the HBP period when timing allows</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_VACT_EN</name>
              <description>enable the return to low-power inside the VACT period when timing allows</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_VFP_EN</name>
              <description>enable the return to low-power inside the VFP period when timing allows</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_VBP_EN</name>
              <description>enable the return to low-power inside the VBP period when timing allows</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_VSA_EN</name>
              <description>enable the return to low-power inside the VSA period when timing allows</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VID_MODE_TYPE</name>
              <description>indicates the video mode transmission type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_pkt_size</name>
          <description>configures the video packet size</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003FFF</resetMask>
          <fields>
            <field>
              <name>VID_PKT_SIZE</name>
              <description>configures the number of pixels in a single video packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_num_chunks</name>
          <description>configures the number of chunks to use</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <fields>
            <field>
              <name>VID_NUM_CHUNKS</name>
              <description>configures the number of chunks to be transmitted a line period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_null_size</name>
          <description>configures the size of null packets</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <fields>
            <field>
              <name>VID_NULL_SIZE</name>
              <description>configures the number of bytes inside a null packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_hsa_time</name>
          <description>configures the video HAS time</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>VID_HSA_TIME</name>
              <description>configure the Horizontal synchronism active period in lane byte clock cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_hbp_time</name>
          <description>configure the video HBP time</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>VID_HPB_TIME</name>
              <description>configures the Horizontal back porch period in lane byte clock cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_hline_time</name>
          <description>configures the overall time for each video line</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <fields>
            <field>
              <name>VID_HLINE_TIME</name>
              <description>configures the size of the total line time in lane byte clock cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_vsa_lines</name>
          <description>configures the vsa period</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>VSA_LINES</name>
              <description>configures the verical synchronism active period measured in number of horizontal lines</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_vbp_lines</name>
          <description>configures the vbp period</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>VBP_LINES</name>
              <description>configures the vertical back porch period measured in number of horizontal lines</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_vfp_lines</name>
          <description>configures the vfp period</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>VFP_LINIES</name>
              <description>configures the vertical front porch period measured in number of horizontal lines</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_vactive_lines</name>
          <description>configures the vertical resolution of video</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003FFF</resetMask>
          <fields>
            <field>
              <name>V_ACTIVE_LINES</name>
              <description>configures the vertical active period measured in number of horizontal lines</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
