hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/HPM6800/HPM68D2/HPM68D2_svd.xml
        <register>
          <name>int_msk0</name>
          <description>configures masks for the sources of interrupt that affec int_st0</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x001FFFFF</resetMask>
          <fields>
            <field>
              <name>MASK_DPHY_ERRORS_4</name>
              <description>disable LP1 contention error ErrContentionLP1 from lane0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_DPHY_ERRORS_3</name>
              <description>disable LP0 contention error ErrContentionLP0 from lane0</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_DPHY_ERRORS_2</name>
              <description>disable control error ErrControl from lane0</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_DPHY_ERRORS_1</name>
              <description>disable ErrSyncEsc low-power data transmission synchronization error from lane 0</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_DPHY_ERRORS_0</name>
              <description>disable ErrEsc escape entry error from lane0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ACK_WITH_ERR_15</name>
              <description>disable the DSI protocal violation from the acknowledge error report</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ACK_WITH_ERR_14</name>
              <description>disable the reserved from the acknowledge error report</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ACK_WITH_ERR_13</name>
              <description>disable the invalid transmission length from the acknowledge error report</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ACK_WITH_ERR_12</name>
              <description>disable the dsi vc id invalid from the acknowledge error report</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ACK_WITH_ERR_11</name>
              <description>disable the not recongnized dsi data type from the acknowledge error report</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ACK_WITH_ERR_10</name>
              <description>disable the checksum error from the acknowledge error report</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ACK_WITH_ERR_9</name>
              <description>disable the ECC error multi-bit from the acknowledge error report</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ACK_WITH_ERR8</name>
              <description>disable the ecc error sigle-bit from the acknowledge error report</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ACK_WITH_ERR7</name>
              <description>disable the reserved from the acknowledge error report</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ACK_WITH_ERR6</name>
              <description>disable the false control error fro the acknowledge error report</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ACK_WITH_ERR5</name>
              <description>disable the peripheral timeout error from the acknowledge error report</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ACK_WITH_ERR4</name>
              <description>disable the LP transmit sync error from the acknowledge error report</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ACK_WITH_ERR3</name>
              <description>disable the Escap mode entry command error from the acknowledge error report</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ACK_WITH_ERR2</name>
              <description>disable the EoT sync error from the acknowledge error report</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ACK_WITH_ERR1</name>
              <description>disable the SoT sync error from the acknowledge error report</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ACK_WITH_ERR0</name>
              <description>disable the SoT serror from the acknowledge error report</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_msk1</name>
          <description>configures masks for int_st1</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00181FFF</resetMask>
          <fields>
            <field>
              <name>MASK_TEAR_REQUEST_ERR</name>
              <description>disable tear_request has occurred but tear effect is not active in dsi host and device</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_DPI_BUFF_PLD_UNDER</name>
              <description>disable an underflow when reading payload to build dsi packet for video mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_GEN_PLD_RECEV_ERR</name>
              <description>disable that during a generic interface packet read back, the payload FIFO full</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_GEN_PLD_RD_ERR</name>
              <description>disable that during a DCS read data, the payload FIFO becomes empty</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_GEN_PLD_SEND_ERR</name>
              <description>disable the payload FIFO become empty when packet build</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_GEN_PLD_WR_ERR</name>
              <description>disable the system tried to write a payload and FIFO is full</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_GEN_CMD_WR_ERR</name>
              <description>disable the system tried to write a command and FIFO is full</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_DPI_BPLD_WR_ERR</name>
              <description>disable the payload FIFO is full during a DPI pixel line storage</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_EOPT_ERR</name>
              <description>disable that the EoTp packet has not been received at the end of the incoming peripheral transmission</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_PKT_SIZE_ERR</name>
              <description>disable that the packet size error has been detected during the packet reception</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_CRC_ERR</name>
              <description>disable that the CRC error has been detected in the reveived packet payload</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ECC_MULTI_ERR</name>
              <description>disable that the ECC multiple error has been detected in a revieved packet</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ECC_SIGLE_ERR</name>
              <description>disable that the ECC single error has been detected and corrected in a reveived packet</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_TO_LP_TX</name>
              <description>disable that the low-power reception timeout counter reached the end and contention has been detected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_TO_HS_TX</name>
              <description>disable that the high-speed transmission timeout counter reached the end and contention has been detected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phy_cal</name>
          <description>controls the skew calibration of D-phy</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>TXSKEWCALHS</name>
              <description>High-speed skew calibration is started when txskewcalhs is
set high (assuming that PHY is in Stop state)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_force0</name>
          <description>forces that affect the int_st0 register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x001FFFFF</resetMask>
          <fields>
            <field>
              <name>FORCE_DPHY_ERRORS_4</name>
              <description>force LP1 contention error ErrContentionLP1 from lane0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_DPHY_ERRORS_3</name>
              <description>force LP0 contention error ErrContentionLP0 from lane0</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_DPHY_ERRORS_2</name>
              <description>force control error ErrControl from lane0</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_DPHY_ERRORS_1</name>
              <description>force ErrSyncEsc low-power data transmission synchronization error from lane 0</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_DPHY_ERRORS_0</name>
              <description>force ErrEsc escape entry error from lane0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ACK_WITH_ERR_15</name>
              <description>force the DSI protocal violation from the acknowledge error report</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ACK_WITH_ERR_14</name>
              <description>force the reserved from the acknowledge error report</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ACK_WITH_ERR_13</name>
              <description>force the invalid transmission length from the acknowledge error report</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ACK_WITH_ERR_12</name>
              <description>force the dsi vc id invalid from the acknowledge error report</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ACK_WITH_ERR_11</name>
              <description>force the not recongnized dsi data type from the acknowledge error report</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ACK_WITH_ERR_10</name>
              <description>force the checksum error from the acknowledge error report</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ACK_WITH_ERR_9</name>
              <description>force the ECC error multi-bit from the acknowledge error report</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ACK_WITH_ERR8</name>
              <description>force the ecc error sigle-bit from the acknowledge error report</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ACK_WITH_ERR7</name>
              <description>force the reserved from the acknowledge error report</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ACK_WITH_ERR6</name>
              <description>force the false control error fro the acknowledge error report</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ACK_WITH_ERR5</name>
              <description>force the peripheral timeout error from the acknowledge error report</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ACK_WITH_ERR4</name>
              <description>force the LP transmit sync error from the acknowledge error report</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ACK_WITH_ERR3</name>
              <description>force the Escap mode entry command error from the acknowledge error report</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ACK_WITH_ERR2</name>
              <description>force the EoT sync error from the acknowledge error report</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ACK_WITH_ERR1</name>
              <description>force the SoT sync error from the acknowledge error report</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ACK_WITH_ERR0</name>
              <description>force the SoT serror from the acknowledge error report</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
