hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/HPM6800/HPM68D2/HPM68D2_svd.xml
        <register>
          <name>sdf_3d_act</name>
          <description>value for sdf_3d</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001003F</resetMask>
          <fields>
            <field>
              <name>SEND_3D_CFG</name>
              <description>When set, causes the next VSS packet to include 3D control
payload in every VSS packet.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RIGHT_FIRST</name>
              <description>This bit specifies the left/right order</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECOND_VSYNC</name>
              <description>This field specifies whether there is a second VSYNC pulse
between Left and Right Images, when 3D Image Format is
Frame-based</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORMAT_3D</name>
              <description>This field specifies 3D Image Format</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MODE_3D</name>
              <description>This field specifies 3D Mode On/Off and Display Orientation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="MIPI_DSI0">
      <name>MIPI_DSI1</name>
      <description>MIPI_DSI1</description>
      <groupName>MIPI_DSI</groupName>
      <baseAddress>0xf1024000</baseAddress>
    </peripheral>
    <peripheral>
      <name>MIPI_CSI0</name>
      <description>MIPI_CSI0</description>
      <groupName>MIPI_CSI</groupName>
      <baseAddress>0xf1028000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2bc</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>version</name>
          <description>version code</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x3134302A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VERSION</name>
              <description>version code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>n_lanes</name>
          <description>the number of active lanes</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>N_LANES</name>
              <description>number of active data lanes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>csi2_resetn</name>
          <description>the internal logic of the controller goes into the reset state when active</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>CSI2_RESETN</name>
              <description>DWC_mipi_csi2_host reset output, active low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_st_main</name>
          <description>contains the stateus of individual interrupt sources</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000700FF</resetMask>
          <fields>
            <field>
              <name>STATUS_INT_IPI4_FATAL</name>
              <description>status of int_st_ipi_fatal</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_LINE</name>
              <description>status of int_st_line</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_PHY</name>
              <description>status of int_st_phy</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_ECC_CORRECTED</name>
              <description>status of status_int_ecc_corrected</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_DATA_ID</name>
              <description>status of status_int_data_id</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_PLD_CRC_FATAL</name>
              <description>status of status_int_pld_crc_fatal</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_CRC_FRAME_FATAL</name>
              <description>status of status_int_crc_frame_fatal</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_SEQ_FRAME_FATAL</name>
              <description>status of status_int_seq_frame_fatal</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_BNDRY_FRAME_FATAL</name>
              <description>status of int_st_bndry_frame_fatal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_PKT_FATAL</name>
              <description>status of int_st_pkt_fatal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_PHY_FATAL</name>
              <description>status of int_st_phy_fatal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>data_ids_1</name>
          <description>programs data type fields for data ID monitors</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F3F3F3F</resetMask>
          <fields>
            <field>
              <name>DI3_DT</name>
              <description>data type for programmed data ID 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DI2_DT</name>
              <description>data type for programmed data ID 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DI1_DT</name>
              <description>data type for programmed data ID 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DI0_DT</name>
              <description>data type for programmed data ID 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>data_ids_2</name>
          <description>programs data type fields for data ID monitors</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F3F3F3F</resetMask>
          <fields>
            <field>
              <name>DI7_DT</name>
              <description>data type for programmed data ID 7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DI6_DT</name>
              <description>data type for programmed data ID 6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DI5_DT</name>
              <description>data type for programmed data ID 5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DI4_DT</name>
              <description>data type for programmed data ID 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_st_ap_main</name>
          <description>contains the status of individual interrupt sources</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <fields>
            <field>
              <name>STATUS_INT_IPI_FATAL</name>
              <description>status of int_st_ipi_fatal</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_ST_AP_IPI_FATAL</name>
              <description>status of int_st_ap_ipi_fatal</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_LINE</name>
              <description>status of int_st_line</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_ECC_CORRECTED</name>
              <description>status of status_int_ecc_corrected</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_DATA_ID</name>
              <description>status of status_int_data_id</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_PLD_CRC_FATAL</name>
              <description>status of status_int_pld_crc_fatal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_PHY</name>
              <description>status of int_st_phy</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_CRC_FRAME_FATAL</name>
              <description>status of status_int_crc_frame_fatal</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_SEQ_FRAME_FATAL</name>
              <description>status of status_int_seq_frame_fatal</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_BNDRY_FRAME_FATAL</name>
              <description>status of int_st_bndry_frame_fatal</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_PKT_FATAL</name>
              <description>status of int_st_pkt_fatal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_PHY_FATAL</name>
              <description>status of int_st_phy_fatal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS_INT_ST_AP_GENERIC</name>
              <description>status of int_st_ap_generic</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phy_shutdownz</name>
          <description>controls the phy shutdown mode</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>PHY_SHUTDOWNZ</name>
              <description>shutdown input,active low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dphy_rstz</name>
          <description>controls the phy reset mode</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>DPHY_RSTZ</name>
              <description>phy reset output, active low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phy_rx</name>
          <description>contains the status of rx-related signals from phy</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x00010000</resetValue>
          <resetMask>0x00030003</resetMask>
          <fields>
            <field>
              <name>PHY_RXCLKACTIVEHS</name>
              <description>indicates the d-phy clock lane is actively receiving a ddr clock</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_RXULPSCLKNOT</name>
              <description>active low. Indicates the d-phy clock lane module has entered the Ultra low power state</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_RXULLPSESC_1</name>
              <description>lane module 1 has entered the ultra low power mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_RXULPSESC_0</name>
              <description>lane module 0 has entered the ultra low power mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phy_stopstate</name>
          <description>contains the stopstate signal status from phy</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00010003</resetMask>
          <fields>
            <field>
              <name>PHY_STOPSTATECLK</name>
              <description>d-phy clock lane in stop state</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_STOPSTATEDATA_1</name>
              <description>data lane 1 in stop state</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_STOPSTATEDATA_0</name>
              <description>data lane 0 in stop state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ipi_mode</name>
          <description>selects how the ipi interface generates the video frame</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01010101</resetMask>
          <fields>
            <field>
              <name>IPI_ENABLE</name>
              <description>enables the interface</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPI_CUT_THROUGH</name>
              <description>cut-through mode state active when high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPI_COLOR_COM</name>
              <description>if color mode components are deliverd as follows: 0x0 48bit intercase  0x1: 16bit interface</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPI_MODE</name>
              <description>indicates the video mode transmission type 0x0: camera timing 0x1:controller timing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ipi_vcid</name>
          <description>selects the vritual channel processed by ipi</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>IPI_VCX_0_1</name>
              <description>virtual channel extension of data to be processed by pixel interface</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_VCID</name>
              <description>virtual channel of data to be processed by pixel interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ipi_data_type</name>
          <description>selects the data type processed by ipi</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000013F</resetMask>
          <fields>
            <field>
              <name>EMBENDED_DATA</name>
              <description>enable embedded data processing on ipi interface</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPI_DATA_TYPE</name>
              <description>data type of data to be processed by pixel interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ipi_mem_flash</name>
          <description>control the flush of ipi memory</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000101</resetMask>
          <fields>
            <field>
              <name>IPI_AUTO_FLUSH</name>
              <description>memory is automatically flashed at each vsync</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPI_FLUSH</name>
              <description>flush ipi memory, this bit is auto clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ipi_hsa_time</name>
          <description>configures the video horizontal synchronism active time</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>IPI_HSA_TIME</name>
              <description>configures the Horizontal Synchronism Active period in pixclk cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
