hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/HPM6800/HPM68D2/HPM68D2_svd.xml
        <register>
          <name>int_force_crc_frame_fatal</name>
          <description>interrupt force register is used for test purposes</description>
          <addressOffset>0x2a8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>FORCE_ERR_F_CRC_MATCH_VC15</name>
              <description>error matching frame start with frame end for virtual channel 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_F_CRC_MATCH_VC14</name>
              <description>error matching frame start with frame end for virtual channel 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_F_CRC_MATCH_VC13</name>
              <description>error matching frame start with frame end for virtual channel 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_F_CRC_MATCH_VC12</name>
              <description>error matching frame start with frame end for virtual channel 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_F_CRC_MATCH_VC11</name>
              <description>error matching frame start with frame end for virtual channel 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_F_CRC_MATCH_VC10</name>
              <description>error matching frame start with frame end for virtual channel 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_F_CRC_MATCH_VC9</name>
              <description>error matching frame start with frame end for virtual channel 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_F_CRC_MATCH_VC8</name>
              <description>error matching frame start with frame end for virtual channel 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_F_CRC_MATCH_VC7</name>
              <description>error matching frame start with frame end for virtual channel 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_F_CRC_MATCH_VC6</name>
              <description>error matching frame start with frame end for virtual channel 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_F_CRC_MATCH_VC5</name>
              <description>error matching frame start with frame end for virtual channel 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_F_CRC_MATCH_VC4</name>
              <description>error matching frame start with frame end for virtual channel 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_F_CRC_MATCH_VC3</name>
              <description>error matching frame start with frame end for virtual channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_F_CRC_MATCH_VC2</name>
              <description>error matching frame start with frame end for virtual channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_F_CRC_MATCH_VC1</name>
              <description>error matching frame start with frame end for virtual channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_F_CRC_MATCH_VC0</name>
              <description>error matching frame start with frame end for virtual channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_st_pld_crc_frame_fatal</name>
          <description>fatal interruption related with matching frame start with frame end for a specific virtual channel</description>
          <addressOffset>0x2b0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>ERR_CRC_MATCH_VC15</name>
              <description>error matching frame start with frame end for virtual channel 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CRC_MATCH_VC14</name>
              <description>error matching frame start with frame end for virtual channel 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CRC_MATCH_VC13</name>
              <description>error matching frame start with frame end for virtual channel 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CRC_MATCH_VC12</name>
              <description>error matching frame start with frame end for virtual channel 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CRC_MATCH_VC11</name>
              <description>error matching frame start with frame end for virtual channel 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CRC_MATCH_VC10</name>
              <description>error matching frame start with frame end for virtual channel 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CRC_MATCH_VC9</name>
              <description>error matching frame start with frame end for virtual channel 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CRC_MATCH_VC8</name>
              <description>error matching frame start with frame end for virtual channel 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CRC_MATCH_VC7</name>
              <description>error matching frame start with frame end for virtual channel 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CRC_MATCH_VC6</name>
              <description>error matching frame start with frame end for virtual channel 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CRC_MATCH_VC5</name>
              <description>error matching frame start with frame end for virtual channel 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CRC_MATCH_VC4</name>
              <description>error matching frame start with frame end for virtual channel 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CRC_MATCH_VC3</name>
              <description>error matching frame start with frame end for virtual channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CRC_MATCH_VC2</name>
              <description>error matching frame start with frame end for virtual channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CRC_MATCH_VC1</name>
              <description>error matching frame start with frame end for virtual channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CRC_MATCH_VC0</name>
              <description>error matching frame start with frame end for virtual channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_msk_pld_crc_frame_fatal</name>
          <description>interrupt mask for int_st_crc_frame_fatal</description>
          <addressOffset>0x2b4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>MSK_ERR_CRC_MATCH_VC15</name>
              <description>error matching frame start with frame end for virtual channel 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK_ERR_CRC_MATCH_VC14</name>
              <description>error matching frame start with frame end for virtual channel 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK_ERR_CRC_MATCH_VC13</name>
              <description>error matching frame start with frame end for virtual channel 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK_ERR_CRC_MATCH_VC12</name>
              <description>error matching frame start with frame end for virtual channel 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK_ERR_CRC_MATCH_VC11</name>
              <description>error matching frame start with frame end for virtual channel 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK_ERR_CRC_MATCH_VC10</name>
              <description>error matching frame start with frame end for virtual channel 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK_ERR_CRC_MATCH_VC9</name>
              <description>error matching frame start with frame end for virtual channel 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK_ERR_CRC_MATCH_VC8</name>
              <description>error matching frame start with frame end for virtual channel 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK_ERR_CRC_MATCH_VC7</name>
              <description>error matching frame start with frame end for virtual channel 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK_ERR_CRC_MATCH_VC6</name>
              <description>error matching frame start with frame end for virtual channel 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK_ERR_CRC_MATCH_VC5</name>
              <description>error matching frame start with frame end for virtual channel 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK_ERR_CRC_MATCH_VC4</name>
              <description>error matching frame start with frame end for virtual channel 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK_ERR_CRC_MATCH_VC3</name>
              <description>error matching frame start with frame end for virtual channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK_ERR_CRC_MATCH_VC2</name>
              <description>error matching frame start with frame end for virtual channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK_ERR_CRC_MATCH_VC1</name>
              <description>error matching frame start with frame end for virtual channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK_ERR_CRC_MATCH_VC0</name>
              <description>error matching frame start with frame end for virtual channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_force_pld_crc_frame_fatal</name>
          <description>interrupt force register is used for test purposes</description>
          <addressOffset>0x2b8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>FORCE_ERR_CRC_MATCH_VC15</name>
              <description>error matching frame start with frame end for virtual channel 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_CRC_MATCH_VC14</name>
              <description>error matching frame start with frame end for virtual channel 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_CRC_MATCH_VC13</name>
              <description>error matching frame start with frame end for virtual channel 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_CRC_MATCH_VC12</name>
              <description>error matching frame start with frame end for virtual channel 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_CRC_MATCH_VC11</name>
              <description>error matching frame start with frame end for virtual channel 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_CRC_MATCH_VC10</name>
              <description>error matching frame start with frame end for virtual channel 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_CRC_MATCH_VC9</name>
              <description>error matching frame start with frame end for virtual channel 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_CRC_MATCH_VC8</name>
              <description>error matching frame start with frame end for virtual channel 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_CRC_MATCH_VC7</name>
              <description>error matching frame start with frame end for virtual channel 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_CRC_MATCH_VC6</name>
              <description>error matching frame start with frame end for virtual channel 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_CRC_MATCH_VC5</name>
              <description>error matching frame start with frame end for virtual channel 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_CRC_MATCH_VC4</name>
              <description>error matching frame start with frame end for virtual channel 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_CRC_MATCH_VC3</name>
              <description>error matching frame start with frame end for virtual channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_CRC_MATCH_VC2</name>
              <description>error matching frame start with frame end for virtual channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_CRC_MATCH_VC1</name>
              <description>error matching frame start with frame end for virtual channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_CRC_MATCH_VC0</name>
              <description>error matching frame start with frame end for virtual channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
