hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/HPM6800/HPM68D2/HPM68D2_svd.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="MIPI_CSI0">
      <name>MIPI_CSI1</name>
      <description>MIPI_CSI1</description>
      <groupName>MIPI_CSI</groupName>
      <baseAddress>0xf102c000</baseAddress>
    </peripheral>
    <peripheral>
      <name>LVB</name>
      <description>LVB</description>
      <groupName>LVB</groupName>
      <baseAddress>0xf1030000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x6c</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0F0307AF</resetMask>
          <fields>
            <field>
              <name>SPLIT_CH_REVERSE</name>
              <description>Just for split mode, reverse two channel data</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIT_CH_MODE</name>
              <description>Just for split mode
1: two channel pixel data are not aligned
0: two channel pixel data are  aligned</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIT_HSWHBP_WIDTH</name>
              <description>Just for split mode, the sum of HSW and HBP width is even
1: yes
0: no</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIT_MODE_EN</name>
              <description>Split mode enable:
1: enable
0: disable
Note: when using split mode, ch0/1 should be enabled, and should select same DI</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DI1_VSYNC_POLARITY</name>
              <description>DI 1 vsync polarity:
1: active low
0: active high</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DI0_VSYNC_POLARITY</name>
              <description>DI 0 vsync polarity:
1: active low
0: active high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDS_TXCLK_SHIFT</name>
              <description>Shift the LVDS TX PHY clock  in relation to the data.
000: txck is 7'b1100011
001: txck is 7‘b1110001
010: txck is 7‘b1111000
011: txck is 7‘b1000111
100: txck is 7‘b0001111
101: txck is 7‘b0011110
110: txck is 7‘b0111100
111: txck is 7‘b1100011</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_BIT_MAPPING</name>
              <description>Channel 1 data protocol:
1: JEIDA standard
0: SPWG standard</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_BIT_MAPPING</name>
              <description>Channel 0 data protocol:
1: JEIDA standard
0: SPWG standard</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_SEL</name>
              <description>Channel 1 select:
1: select DI 1
0: select DI 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_EN</name>
              <description>Channel 1 enable:
1: enable
0: disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_SEL</name>
              <description>Channel 0 select:
1: select DI 1
0: select DI 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_EN</name>
              <description>Channel 0 enable:
1: enable
0: disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_STAT</name>
          <description>LVDS TX PHY Status register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>LVDS1_TX_PHY_PLL_LOCK</name>
              <description>LVDS1 TX PHY PLL Lock indication Signal, 1 means pll already locked</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LVDS0_TX_PHY_PLL_LOCK</name>
              <description>LVDS0 TX PHY PLL Lock indication Signal, 1 means pll already locked</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>lvds0,lvds1</dimIndex>
          <name>PHY_POW_CTRL[%s]</name>
          <description>no description available</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>PWON_PLL</name>
              <description>pll power on</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCK_PD</name>
              <description>Power down control signal of channel txck
0: Normal operation
1: Power down channel</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX3_PD</name>
              <description>Power down control signal of channel tx3
0: Normal operation
1: Power down channel</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX2_PD</name>
              <description>Power down control signal of channel tx2
0: Normal operation
1: Power down channel</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX1_PD</name>
              <description>Power down control signal of channel tx1
0: Normal operation
1: Power down channel</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX0_PD</name>
              <description>Power down control signal of channel tx0
0: Normal operation
1: Power down channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>10</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>lvds0_tx0,lvds0_tx1,lvds0_tx2,lvds0_tx3,lvds0_txck,lvds1_tx0,lvds1_tx1,lvds1_tx2,lvds1_tx3,lvds1_txck</dimIndex>
          <name>TX_PHY[%s]</name>
          <description>no description available</description>
          <addressOffset>0x1c</addressOffset>
          <register>
            <name>CTL0</name>
            <description>TX PHY Setting</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x000A0358</resetValue>
            <resetMask>0x001FFFFF</resetMask>
            <fields>
              <field>
                <name>TX_IDLE</name>
                <description>Force the high-speed differential signal to common mode.
This signal can be set during IP power up stage to prevent unexpected leakage current in TXP/TXN
0: Normal operation
1: Force TXPN /TXMN to common mode</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_RTERM_EN</name>
                <description>Inner Terminal Resistance enable
0: Disable rterm 2000ohm
1: Enable rterm 100ohm</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_BUS_WIDTH</name>
                <description>Parallel data bus width select：
000: 4-bit mode, txN_data[3:0] are valid, txN_data[11:4] can be arbitrary state.
001: 6-bit mode, txN_data[5:0] are valid, txN_data[11:6] can be arbitrary state.
010: 7-bit mode. txN_data[6:0] are valid, txN_data[11:7] can be arbitrary state.
011: 8-bit mode. txN_data[7:0] are valid, txN_data[11:8] can be arbitrary state.
100: 9-bit mode. txN_data[8:0] are valid, txN_data[11:9] can be arbitrary state.
101: 10-bit mode. txN_data[9:0] are valid, txN_data[11:10] can be arbitrary state.
110: 11-bit mode. txN_data[10:0] are valid, txN_data[11] can be arbitrary state.
111: 12-bit mode. txN_data[11:0] are valid</description>
                <bitOffset>16</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_PHASE_SEL</name>
                <description>data/clock lane output phase adjustment:
0000: 0
0001: data lane is 1/32, clock lane is 1/16
0010: data lane is 2/32, clock lane is 2/16
0011: data lane is 3/32, clock lane is 3/16
0100: data lane is 4/32, clock lane is 4/16
0101: data lane is 5/32, clock lane is 5/16
0110: data lane is 6/32, clock lane is 6/16
0111: data lane is 7/32, clock lane is 7/16
1000: data lane is 8/32, clock lane is 8/16
1001: data lane is 9/32, clock lane is 9/16
1010: data lane is 10/32, clock lane is 10/16
1011: data lane is 11/32, clock lane is 11/16
1100: data lane is 12/32, clock lane is 12/16
1101: data lane is 13/32, clock lane is 13/16
1110: data lane is 14/32, clock lane is 14/16
1111: data lane is 15/32, clock lane is 15/16</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_VCOM</name>
                <description>output Common Mode Voltage adjustment(Unit: V).
0000: 0.7
0001: 0.8
0010: 0.9
0011: 1.0
0100: 1.1
0101: 1.2
0110: 1.3
0111: 1.4
1000~1111: 1.5</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_AMP</name>
                <description>Output voltage Adjustment(Unit: mV).
0000 : 50
0001: 100
0010: 150
0011: 200
0100: 250
0101: 300
0110: 350
0111: 400
1000: 450
1001: 500
1010: 550
1011~1111: 600</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_SR</name>
                <description>output slew-rate trimming
00: slowest slew-rate;
11: fastest slew-rate</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_DEEMP</name>
                <description>output de-emphasis level trimming(Unit: dB)
00: 0
01: 2.5
10: 6.0
11: 6.0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CTL1</name>
            <description>TX_PHY Setting</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00000080</resetValue>
            <resetMask>0x000FFFFF</resetMask>
            <fields>
              <field>
                <name>TX_CTL</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
