hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/HPM6800/HPM68D2/HPM68D2_svd.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>GPU</name>
      <description>GPU</description>
      <groupName>GPU</groupName>
      <baseAddress>0xf1080000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x50c</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>AQHiClockControl</name>
          <description>clock control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00070100</resetValue>
          <resetMask>0x000F3FFE</resetMask>
          <fields>
            <field>
              <name>ISOLATE_GPU</name>
              <description>isolate GPU bit, used for power on/off</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLE_VG</name>
              <description>vg pipe is idle</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE2_D</name>
              <description>2D pipe is idle or not present</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE3_D</name>
              <description>3D pipe is idle or not present</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLE_RAM_POWER_OPTIMIZATION</name>
              <description>disables ram power optimization</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFT_RESET</name>
              <description>soft reset the IP</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_DEBUG_REGISTERS</name>
              <description>disable debug registers</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_RAM_CLOCK_GATING</name>
              <description>disables clock gating for rams</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSCALE_CMD_LOAD</name>
              <description>core clock frequency scale value enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSCALE_VAL</name>
              <description>core clock frequency scale value</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK2D_DIS</name>
              <description>disable 2D/VG clock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AQHildle</name>
          <description>idle status register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x80001FFF</resetValue>
          <resetMask>0x80001FFF</resetMask>
          <fields>
            <field>
              <name>AXI_LP</name>
              <description>axi is in low power mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE_BLT</name>
              <description>BLT is idle or not present</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE_TS</name>
              <description>Tessellation Engine is idle</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE_FP</name>
              <description>FP is idle or not present</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE_IM</name>
              <description>Image Engine is idle</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE_VG</name>
              <description>Vector Graphics Engine is idle</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE_TX</name>
              <description>TX is idle or not present</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE_RA</name>
              <description>RA is idle or not present</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE_SE</name>
              <description>SE is idle or not present</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE_PA</name>
              <description>PA is idle or not present</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE_SH</name>
              <description>SH is idle or not present</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE_PE</name>
              <description>Pixel engine is idle</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE_DE</name>
              <description>DE is dile or not present</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE_FE</name>
              <description>0: fetch engine is busy  1:fetch engine is idle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AQIntrAcknowledge</name>
          <description>interrupt acknoledge register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTR_VEC</name>
              <description>for each interrupt event, 0=clear,1=interrupt active</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AQIntrEnbl</name>
          <description>interrupt enable register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTR_ENBL_VEC</name>
              <description>0=disable interrupt; 1=enable interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GCChipRev</name>
          <description>chip revison register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REV</name>
              <description>revision</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GCChipDate</name>
          <description>chip date register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATE</name>
              <description>date</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gcregHIChipPatchRev</name>
          <description>chip patch revision register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>PATCH_REV</name>
              <description>patch revision</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gcProductID</name>
          <description>product identification register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0x03002655</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>TYPE</name>
              <description>product type is 3:VG</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM</name>
              <description>product number is 265</description>
              <bitOffset>4</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GRADE_LEVEL</name>
              <description>0:None_no extra letter on the product name for this core 1:nano 5:nano ultra</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gcModulePowerControls</name>
          <description>module power control register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0x00000020</resetValue>
          <resetMask>0xFFFF00F7</resetMask>
          <fields>
            <field>
              <name>TURN_OFF_COUNTER</name>
              <description>counter value for clock gating the module if the module is idle for this amout of clock cycles</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TURN_ON_COUNTER</name>
              <description>number of clock cycle gating the module if the modules is idle for this amout of clockk cycles</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_STARVE_MODULE_CLOCK_GATING</name>
              <description>disable module level clock gating for starve/idle condition</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_STALL_MODULE_CLOCK_GATING</name>
              <description>disable module level clock gating for stall condition</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_MODULE_CLOCK_GATING</name>
              <description>enable module level clock gating</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gcModulePowerModuleControl</name>
          <description>module power module control register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001B05</resetMask>
          <fields>
            <field>
              <name>DISABLE_MODULE_CLOCKGATING_FLEXA</name>
              <description>disables module level clock gating for flexa, not supported for all variants</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_MODULE_CLOCK_GATING_TS</name>
              <description>disables module level clock gating for TS</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_MODULE_CLOCK_GATING_IM</name>
              <description>disables module level clock gating for IM</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_MODULE_CLOCK_GATING_VG</name>
              <description>disables module lelvel clock gating for VG</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_MODULE_CLOCK_GATING_PE</name>
              <description>disables module level clock gating for PE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_MODULE_CLOCK_GATING_FE</name>
              <description>disables module level clock gating for FE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gcModulePowerModuleStatus</name>
          <description>module power module status register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001B05</resetMask>
          <fields>
            <field>
              <name>MODULE_CLOCK_GATED_FLEXA</name>
              <description>module level ckock gating is on for flexa</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MODULE_CLOCK_GATED_TS</name>
              <description>module level ckock gating is on for ts</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MODULE_CLOCK_GATED_IM</name>
              <description>module level clock gating is on for IM</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MODULE_CLOCK_GATED_VG</name>
              <description>module level clock gating is on for VG</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MODULE_CLOCK_GATED_PE</name>
              <description>module level clock gating is on for PE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MODULE_CLOCK_GATED_FE</name>
              <description>module level clock gating is on for FE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AQMemoryFePageTable</name>
          <description>fetch engine page table base address register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFF000</resetMask>
          <fields>
            <field>
              <name>BASE_ADDRESS</name>
              <description>base address for the FE virtual address lookup table</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AQMemoryDebug</name>
          <description>memory debug register</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <resetValue>0x3C000000</resetValue>
          <resetMask>0x3F0000FF</resetMask>
          <fields>
            <field>
              <name>ZCOMP_LIMIT</name>
              <description>not relevant for vector graphics IP</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX_OUTSTANDING_READS</name>
              <description>limits the total number of outstanding read requests</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AQRegisterTimingControl</name>
          <description>timing control register</description>
          <addressOffset>0x42c</addressOffset>
          <size>32</size>
          <resetValue>0x00030000</resetValue>
          <resetMask>0x001FFFFF</resetMask>
          <fields>
            <field>
              <name>POWER_DOWN</name>
              <description>powerdown memory</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_WTC</name>
              <description>WTC for fast rams</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_RTC</name>
              <description>RTC for fast rams</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FOR_RF2P</name>
              <description>for 2 port ram</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FOR_RF1P</name>
              <description>for 1 port ram</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gcregFetchAddress</name>
          <description>fetch command buffer base address register</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>address of command buffer</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TYPE</name>
              <description>0=system  2=vritual 1=local</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gcregFetchControl</name>
          <description>fetch control register</description>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x001FFFFF</resetMask>
          <fields>
            <field>
              <name>COUNT</name>
              <description>number of 64bit words to fetch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gcregCurrentFetchAddress</name>
          <description>current fetch command address register</description>
          <addressOffset>0x508</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
