hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/HPM6800/HPM68D2/HPM68D2_svd.xml
        <register>
          <name>MISC_CTRL1</name>
          <description>No description available</description>
          <addressOffset>0x3004</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xB3F3F000</resetMask>
          <fields>
            <field>
              <name>CARD_ACTIVE</name>
              <description>SW write 1 to start card clock delay counter(delay time is configed by CARD_ACTIVE_PERIOD_SEL).
When counter finished, this bit will be cleared by hardware.
Write 1 when this bit is 1 will cause unknown result(actually no use except write at exact finish time)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARD_ACTIVE_PERIOD_SEL</name>
              <description>card clock delay config.
00 for 100 cycle; 01 for 74 cycle; 10 for 128 cycle; 11 for 256 cycle</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARDCLK_DLYSEL</name>
              <description>for card clock DLL, default 0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_DLYSEL</name>
              <description>for strobe DLL, default 7taps(1ns)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="SDXC0">
      <name>SDXC1</name>
      <description>SDXC1</description>
      <groupName>SDXC</groupName>
      <baseAddress>0xf1134000</baseAddress>
    </peripheral>
    <peripheral>
      <name>DDRCTL</name>
      <description>DDRCTL</description>
      <groupName>DDRCTL</groupName>
      <baseAddress>0xf3010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xf34</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MSTR</name>
          <description>Description: Master Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x03040001</resetValue>
          <resetMask>0x0F0FB601</resetMask>
          <fields>
            <field>
              <name>ACTIVE_RANKS</name>
              <description>Description: Only present for multi-rank configurations. Each bit represents one rank. For two-rank configurations, only bits[25:24] are present.
1 - populated
0 - unpopulated
LSB is the lowest rank number.
For 2 ranks following combinations are legal:
01 - One rank
11 - Two ranks
Others - Reserved.
For 4 ranks following combinations are legal:
0001 - One rank
0011 - Two ranks
1111 - Four ranks
Value After Reset: "(MEMC_NUM_RANKS==4) ? 0xF
:((MEMC_NUM_RANKS==2) ? 0x3 : 0x1)"
Exists: MEMC_NUM_RANKS&gt;1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BURST_RDWR</name>
              <description>Description: SDRAM burst length used:
0001 - Burst length of 2 (only supported for mDDR)
0010 - Burst length of 4
0100 - Burst length of 8
1000 - Burst length of 16 (only supported for mDDR and LPDDR2)
All other values are reserved.
This controls the burst size used to access the SDRAM. This must match the burst length mode register setting in the SDRAM. Burst length of 2 is not supported with AXI ports when MEMC_BURST_LENGTH is 8.
Value After Reset: 0x4
Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_OFF_MODE</name>
              <description>Description: Set to 1 when uMCTL2 and DRAM has to be put in DLL-off mode for low frequency operation.
Set to 0 to put uMCTL2 and DRAM in DLL-on mode for normal frequency operation.
Value After Reset: 0x0
Exists: MEMC_DDR3_OR_4==1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BUS_WIDTH</name>
              <description>Description: Selects proportion of DQ bus width that is used by the SDRAM
00 - Full DQ bus width to SDRAM
01 - Half DQ bus width to SDRAM
10 - Quarter DQ bus width to SDRAM
11 - Reserved.
Note that half bus width mode is only supported when the SDRAM bus width is a multiple of 16, and quarter bus width mode is only supported when the SDRAM bus width is a multiple of 32 and the configuration parameter MEMC_QBUS_SUPPORT is set. Bus width refers to DQ bus width (excluding any ECC width).
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_2T_TIMING_MODE</name>
              <description>Description: If 1, then uMCTL2 uses 2T timing. Otherwise, uses 1T timing. In 2T timing, all command signals (except chip select) are held for 2 clocks on the SDRAM bus. Chip select is asserted on the second cycle of the command
Note: 2T timing is not supported in LPDDR2/LPDDR3 mode Note: 2T timing is not supported if the configuration parameter MEMC_CMD_RTN2IDLE is set
Note: 2T timing is not supported in DDR4 geardown mode.
Value After Reset: 0x0
Exists: MEMC_CMD_RTN2IDLE==0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BURSTCHOP</name>
              <description>Description: When set, enable burst-chop in DDR3/DDR4. This is only supported in full bus width mode (MSTR.data_bus_width = 00). If DDR4 CRC/parity retry is enabled (CRCPARCTL1.crc_parity_retry_enable = 1), burst chop is not supported, and this bit must be set to '0'
Value After Reset: 0x0
Exists: MEMC_DDR3==1 || MEMC_DDR4==1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DDR3</name>
              <description>Description: Select DDR3 SDRAM
1 - DDR3 SDRAM device in use
0 - non-DDR3 SDRAM device in use Only present in designs that support DDR3.
Value After Reset: "(MEMC_DDR3_EN==1) ? 0x1 : 0x0"
Exists: MEMC_DDR3==1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>Description: Operating Mode Status Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000037</resetMask>
          <fields>
            <field>
              <name>SELFREF_TYPE</name>
              <description>Description: Flags if Self Refresh is entered and if it was under Automatic Self Refresh control only or not.
00 - SDRAM is not in Self Refresh
11 - SDRAM is in Self Refresh and Self Refresh was caused by Automatic Self Refresh only
10 - SDRAM is in Self Refresh and Self Refresh was not caused solely under Automatic Self Refresh control. It could have been caused by Hardware Low Power Interface and/or Software (reg_ddrc_selfref_sw).
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPERATING_MODE</name>
              <description>Description: Operating mode. This is 3-bits wide in configurations with mDDR/LPDDR2/LPDDR3/DDR4 support and 2-bits in all other configurations.
non-mDDR/LPDDR2/LPDDR3 and non-DDR4 designs:
00 - Init
01 - Normal
10 - Power-down
11 - Self refresh
mDDR/LPDDR2/LPDDR3 or DDR4 designs:
000 - Init
001 - Normal
010 - Power-down
011 - Self refresh
1XX - Deep power-down / Maximum Power Saving Mode
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCTRL0</name>
          <description>Description: Mode Register Read/Write Control Register 0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x00000030</resetValue>
          <resetMask>0x8000F0F0</resetMask>
          <fields>
            <field>
              <name>MR_WR</name>
              <description>Description: Setting this register bit to 1 triggers a mode register read or write operation. When the MR operation is complete, the uMCTL2 automatically clears this bit. The other register fields of this register must be written in a separate APB transaction, before setting this mr_wr bit. It is recommended NOT to set this signal if in Init, Deep power- down or MPSM operating modes.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MR_ADDR</name>
              <description>Description: Address of the mode register that is to be written to.
0000 - MR0
0001 - MR1
0010 - MR2
0011 - MR3
0100 - MR4
0101 - MR5
0110 - MR6
0111 - MR7
Don't Care for LPDDR2/LPDDR3 (see MRCTRL1.mr_data for mode register addressing in LPDDR2/LPDDR3)
This signal is also used for writing to control words of RDIMMs. In that case, it corresponds to the bank address bits sent to the RDIMM
In case of DDR4, the bit[3:2] corresponds to the bank group bits. Therefore, the bit[3] as well as the bit[2:0] must be set to an appropriate value which is considered both the Address Mirroring of UDIMMs/RDIMMs and the Output Inversion of RDIMMs.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MR_RANK</name>
              <description>Description: Controls which rank is accessed by MRCTRL0.mr_wr. Normally, it is desired to access all ranks, so all bits should be set to 1. However, for multi-rank UDIMMs/RDIMMs which implement address mirroring, it may be necessary to access ranks individually.
Examples (assume uMCTL2 is configured for 4 ranks):
0x1 - select rank 0 only
0x2 - select rank 1 only
0x5 - select ranks 0 and 2
0xA - select ranks 1 and 3
0xF - select ranks 0, 1, 2 and 3
Value After Reset: "(MEMC_NUM_RANKS==4) ? 0xF
:((MEMC_NUM_RANKS==2) ? 0x3 : 0x1)"
Exists: Always</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCTRL1</name>
          <description>Description: Mode Register Read/Write Control Register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>MR_DATA</name>
              <description>Description: Mode register write data for all non- LPDDR2/non-LPDDR3 modes.
For LPDDR2/LPDDR3, MRCTRL1[15:0] are interpreted as [15:8] MR Address and [7:0] MR data for writes, don't care for reads. This is 18-bits wide in configurations with DDR4 support and 16-bits in all other configurations.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MRSTAT</name>
          <description>Description: Mode Register Read/Write Status Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>MR_WR_BUSY</name>
              <description>Description: The SoC core may initiate a MR write operation only if this signal is low. This signal goes high in the clock after the uMCTL2 accepts the MRW/MRR request. It goes low when the MRW/MRR command is issued to the SDRAM. It is recommended not to perform MRW/MRR commands when 'MRSTAT.mr_wr_busy' is high.
0 - Indicates that the SoC core can initiate a mode register write operation
1 - Indicates that mode register write operation is in progress
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRCTL</name>
          <description>Description: Low Power Control Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000002B</resetMask>
          <fields>
            <field>
              <name>SELFREF_SW</name>
              <description>Description: A value of 1 to this register causes system to move to Self Refresh state immediately, as long as it is not in INIT or DPD/MPSM operating_mode. This is referred to as Software Entry/Exit to Self Refresh.
1 - Software Entry to Self Refresh
0 - Software Exit from Self Refresh
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_DFI_DRAM_CLK_DISABLE</name>
              <description>Description: Enable the assertion of dfi_dram_clk_disable whenever a clock is not required by the SDRAM.
If set to 0, dfi_dram_clk_disable is never asserted. Assertion of dfi_dram_clk_disable is as follows:
In DDR2/DDR3, can only be asserted in Self Refresh. In DDR4, can be asserted in following:
in Self Refresh.
in Maximum Power Saving Mode
In mDDR/LPDDR2/LPDDR3, can be asserted in following:
in Self Refresh
in Power Down
in Deep Power Down
during Normal operation (Clock Stop)
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POWERDOWN_EN</name>
              <description>Description: If true then the uMCTL2 goes into power-down after a programmable number of cycles "maximum idle clocks before power down" (PWRTMG.powerdown_to_x32).
This register bit may be re-programmed during the course of normal operation.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELFREF_EN</name>
              <description>Description: If true then the uMCTL2 puts the SDRAM into Self Refresh after a programmable number of cycles "maximum idle clocks before Self Refresh (PWRTMG.selfref_to_x32)". This register bit may be re- programmed during the course of normal operation.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRTMG</name>
          <description>Description: Low Power Timing Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x00400010</resetValue>
          <resetMask>0x00FF001F</resetMask>
          <fields>
            <field>
              <name>SELFREF_TO_X32</name>
              <description>Description: After this many clocks of NOP or deselect the uMCTL2 automatically puts the SDRAM into Self Refresh. This must be enabled in the PWRCTL.selfref_en.
Unit: Multiples of 32 clocks. FOR PERFORMANCE ONLY.
Value After Reset: 0x40
Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POWERDOWN_TO_X32</name>
              <description>Description: After this many clocks of NOP or deselect the uMCTL2 automatically puts the SDRAM into power-down. This must be enabled in the PWRCTL.powerdown_en.
Unit: Multiples of 32 clocks FOR PERFORMANCE ONLY.
Value After Reset: 0x10
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HWLPCTL</name>
          <description>Description: Hardware Low Power Control Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x0FFF0003</resetMask>
          <fields>
            <field>
              <name>HW_LP_IDLE_X32</name>
              <description>Description: Hardware idle period. The cactive_ddrc output is driven low if the system is idle for hw_lp_idle * 32 cycles if not in INIT or DPD/MPSM operating_mode. The hardware idle function is disabled when hw_lp_idle_x32=0.
Unit: Multiples of 32 clocks. FOR PERFORMANCE ONLY.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HW_LP_EXIT_IDLE_EN</name>
              <description>Description: When this bit is programmed to 1 the cactive_in_ddrc pin of the DDRC can be used to exit from the automatic clock stop, automatic power down or automatic self-refresh modes. Note, it will not cause exit of Self-Refresh that was caused by Hardware Low Power Interface and/or Software (PWRCTL.selfref_sw).
Value After Reset: 0x1
Exists: Always</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HW_LP_EN</name>
              <description>Description: Enable for Hardware Low Power Interface.
Value After Reset: 0x1
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFSHCTL0</name>
          <description>Description: Refresh Control Register 0</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x00210000</resetValue>
          <resetMask>0x00F1F1F0</resetMask>
          <fields>
            <field>
              <name>REFRESH_MARGIN</name>
              <description>Description: Threshold value in number of clock cycles before the critical refresh or page timer expires. A critical refresh is to be issued before this threshold is reached. It is recommended that this not be changed from the default value, currently shown as 0x2. It must always be less than internally used t_rfc_nom_x32. Note that, in LPDDR2/LPDDR3, internally used t_rfc_nom_x32 may be equal to RFSHTMG.t_rfc_nom_x32&gt;&gt;2 if derating is enabled (DERATEEN.derate_enable=1). Otherwise, internally used t_rfc_nom_x32 will be equal to RFSHTMG.t_rfc_nom_x32.
Unit: Multiples of 32 clocks. Value After Reset: 0x2 Exists: Always</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFRESH_TO_X32</name>
              <description>Description: If the refresh timer (tRFCnom, also known as tREFI) has expired at least once, but it has not expired (RFSHCTL0.refresh_burst+1) times yet, then a speculative refresh may be performed. A speculative refresh is a refresh performed at a time when refresh would be useful, but before it is absolutely required. When the SDRAM bus is idle for a period of time determined by this RFSHCTL0.refresh_to_x32 and the refresh timer has expired at least once since the last refresh, then a speculative refresh is performed. Speculative refreshes continues successively until there are no refreshes pending or until new reads or writes are issued to the uMCTL2.
FOR PERFORMANCE ONLY.
Value After Reset: 0x10
Exists: Always</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFRESH_BURST</name>
              <description>Description: The programmed value + 1 is the number of refresh timeouts that is allowed to accumulate before traffic is blocked and the refreshes are forced to execute. Closing pages to perform a refresh is a one-time penalty that must be paid for each group of refreshes. Therefore, performing refreshes in a burst reduces the per-refresh penalty of these page closings. Higher numbers for RFSHCTL.refresh_burst slightly increases utilization; lower numbers decreases the worst-case latency associated with refreshes.
0 - single refresh
1 - burst-of-2 refresh
7 - burst-of-8 refresh
For information on burst refresh feature refer to section 3.9 of DDR2 JEDEC specification - JESD79-2F.pdf.
For DDR2/3, the refresh is always per-rank and not per- bank. The rank refresh can be accumulated over 8*tREFI cycles using the burst refresh feature. In DDR4 mode, according to Fine Granuarity feature, 8 refreshes can be postponed in 1X mode, 16 refreshes in 2X mode and 32 refreshes in 4X mode. If using PHY-initiated updates, care must be taken in the setting of RFSHCTL0.refresh_burst, to ensure that tRFCmax is not violated due to a PHY-initiated update occurring shortly before a refresh burst was due. In this situation, the refresh burst will be delayed until the PHY- initiated update is complete.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
