hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/HPM6800/HPM68D2/HPM68D2_svd.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="MIPI_DSI_PHY0">
      <name>MIPI_DSI_PHY1</name>
      <description>MIPI_DSI_PHY1</description>
      <groupName>MIPI_DSI_PHY</groupName>
      <baseAddress>0xf4144000</baseAddress>
    </peripheral>
    <peripheral>
      <name>MIPI_CSI_PHY0</name>
      <description>MIPI_CSI_PHY0</description>
      <groupName>MIPI_CSI_PHY</groupName>
      <baseAddress>0xf4148000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xd28</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>soft_rst</name>
          <description>soft reset control</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>HS_CLK_SOFT_RST</name>
              <description>the soft reset of clk_hs domain</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_CLK_SOFT_RST</name>
              <description>the soft reset of clk_cfg domain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phy_rcal</name>
          <description>dphy resistor calibration</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x0000E00F</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>RCAL_DONE</name>
              <description>hs-rx terminal trimming done indicator signal</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RCAL_OUT</name>
              <description>hs-rx terminal trimming results</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RCAL_CTL</name>
              <description>rcal function control</description>
              <bitOffset>5</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCAL_TRIM</name>
              <description>default value of HS-RX terminal configure</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCAL_EN</name>
              <description>enable hs-rx terminal trimming</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ulp_rx_en</name>
          <description>enable lprx and ulprx</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x000000E3</resetValue>
          <resetMask>0x000000E3</resetMask>
          <fields>
            <field>
              <name>CSI_1_ULPRX_EN</name>
              <description>data lane1 ulp-rx receiver enable control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_0_ULPRX_EN</name>
              <description>data lane0 ulp-rx receiver enable control</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CLK_ULPRX_EN</name>
              <description>clock lane ulp-rx receiver enable control</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_1_LPRX_EN</name>
              <description>data lane1 lp-rx receiver enable control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CLK_LPRX_EN</name>
              <description>clock lane lp=rx receiver enable control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>voffcal_out</name>
          <description>hs-rx dc-offset auto-calibration results</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFF000</resetMask>
          <fields>
            <field>
              <name>CSI_CLK_VOFFCAL_DONE</name>
              <description>clock lane hs-rx dc-offset auto-calibration done</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSI_CLK_VOFFCAL_OUT</name>
              <description>clock lane hs-rx dc-offset auto-calibration results</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSI_0_VOFFCAL_DONE</name>
              <description>data lane0 hs-rx dc-offset auto-calibration done</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSI_O_VOFFCAL_OUT</name>
              <description>data lane0 hs-rx dc-offset auto-calibration result</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSI_1_VOFFCAL_DONE</name>
              <description>data lane1 hs-rx dc-offset auto-calibration done</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSI_1_VOFFCAL_OUT</name>
              <description>data lane1 hs-rx dc-offset auto-calibration result</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>csi_ctl01</name>
          <description>dphy hardcore control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F7F3F7F</resetMask>
          <fields>
            <field>
              <name>CSI_CTL1_7</name>
              <description>clock lane hs-rx dc-offset auto-calibration enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CTL1_6</name>
              <description>clock lane hs-rx dc-offset trimming control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CTL1_5</name>
              <description>ulprx_vref_trim</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CTL1_4</name>
              <description>bypass hs_rx_voffcal_en</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CTL1_3</name>
              <description>hs_rx_voffcal_trim_polar</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CTL1_2</name>
              <description>ulprx_lpen</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CTL1_1</name>
              <description>force data lane-n and clock lane lp/ulprx to be normal operation</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CTL1_0</name>
              <description>force data lane-n and clock lane hs-rx to be normal operation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CTL0_7</name>
              <description>clock lane hs-rx dc-offset auto-calibration enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CTL0_6</name>
              <description>clock lane hs-rx dc-offset trimming control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CTL0_5</name>
              <description>ulprx_vref_trim</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CTL0_4</name>
              <description>bypass hs_rx_voffcal_en</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CTL0_3</name>
              <description>hs_rx_voffcal_trim_polar</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CTL0_2</name>
              <description>ulprx_lpen</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CTL0_1</name>
              <description>force data lane-n and clock lane lp/ulprx to be normal operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CTL0_0</name>
              <description>force data lane-n and clock lane hs-rx to be normal operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>csi_ctl23</name>
          <description>dphy hardcore control</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1F1F0000</resetMask>
          <fields>
            <field>
              <name>CSI_CTL3_3</name>
              <description>data lane-1 skew trimming enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CTL3_2</name>
              <description>data lane-1 hs-rx skew adjust with binary code</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CTL3_1</name>
              <description>data lane-0 skew trimming enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CTL3_0</name>
              <description>data lane-0 hs-rx skew adjust with binary code</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>csi_vinit</name>
          <description>ulp lp-rx input threshold voltage trimming for data lane</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x00200000</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <fields>
            <field>
              <name>CSI_LPRX_VREF_TRIM</name>
              <description>pt ft indicator in csi clk data lane</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CLK_LPRX_VINT</name>
              <description>pt ft indicator in csi clk lane</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSI_1_LPRX_VINIT</name>
              <description>pt ft indicator in csi lane-1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSI_0_LPRX_VINIT</name>
              <description>pt ft indicator in csi lane-0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>clane_para</name>
          <description>clock lane parameter</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x00000314</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>T_CLK_TERMEN</name>
              <description>time for the clock lane receiver to enable the HS line termination</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_CLK_SETTLE</name>
              <description>the value of tclk-settle of clklane</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>t_hs_termen</name>
          <description>t-termen of all datalane</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x00000303</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>T_D1_TERMEN</name>
              <description>the value of ths-termen of datalane1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_D0_TERMEN</name>
              <description>the value of ths-termen of datalane0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>t_hs_settle</name>
          <description>t-settle of all data lanes</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x00000A0A</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>T_D1_SETTLE</name>
              <description>the value of ths-settle of data lane1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_D0_SETTLE</name>
              <description>the value of ths-settle of data lane0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>t_clane_init</name>
          <description>t-init of clock lane</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x00007530</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>T_CLK_INIT</name>
              <description>initialization time of lock lane</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>t_lane_init0</name>
          <description>t-init of data lane0</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x00007530</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>T_D0_INIT</name>
              <description>initialization time of data lane</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>t_lane_init1</name>
          <description>t-init of data lane1</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x00007530</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>T_D1_INIT</name>
              <description>initialization time of data lane</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>tlpx_ctrl</name>
          <description>the time of tlpx_ctrl of all lane</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>EN_TLPX_CHECK</name>
              <description>enable the tlpx width check</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TLPX</name>
              <description>the width of tlpx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ne_swap</name>
          <description>lane swap and dp/dn swap select</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x00000004</resetValue>
          <resetMask>0x0000030F</resetMask>
          <fields>
            <field>
              <name>DPDN_SWAP_LANE1</name>
              <description>datalane1 dpdn swap</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPDN_SWAP_LAN0</name>
              <description>datalane0 dpdn swap</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LANE_SWAP_LAN1</name>
              <description>data lane1 swap</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LANE_SWAP_LANE0</name>
              <description>data lane0 swap</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>misc_info</name>
          <description>misc info of dphyrx_pcs control</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>ULPS_LP10_SEL</name>
              <description>the lp10 select signal in ulps_exit state</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LONG_SOTSYNC_EN</name>
              <description>at least six zero is checked before sot swquence "00011101"</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
